# Pandas Summary
- http://pandas.pydata.org/pandas-docs/stable/10min.html
- Object Creation
- Viewing Data
- Selection
- Setting
- Missing Data
- Operations
- Merge
- Grouping
- Reshaping
- Time Series

In [4]:
import pandas as pd
import numpy as np

### Object Creation

##### create Series

In [7]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

##### create DataFrame

In [ ]:
dates = pd.date_range('20130101', periods = 6)
data

In [8]:
# date_range : 날짜 데이터에 대한 range데이터를 설정할수 있다.
# freq : Y-M-D H:MIN:S (년-월-일 시:분:초)
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randint(-5, 5, size=(6,4)), index=dates, columns=list('ABCD'))
df

            A  B  C  D
2013-01-01  0  0  1 -1
2013-01-02  4 -4 -1  2
2013-01-03 -1  1 -2 -1
2013-01-04 -2  1  4 -3
2013-01-05 -5 -2 -5  4
2013-01-06 -4  3  0 -5

In [7]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index=list(range(4)),dtype='float32'), # index 0~4에 데이터 1이 float32 type으로 들어감
                    'D' : np.array([3] * 4,dtype='int32'), # [3] * 4 = [3,3,3,3]
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### Viewing Data

In [7]:
# Describe shows a quick statistic summary
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.166667  0.166667 -1.833333  0.000000
std    3.311596  2.926887  2.857738  3.405877
min   -5.000000 -3.000000 -5.000000 -4.000000
25%   -1.500000 -2.250000 -4.500000 -2.750000
50%    0.500000  0.000000 -1.500000  0.000000
75%    2.500000  2.250000  0.750000  2.750000
max    4.000000  4.000000  1.000000  4.000000

In [8]:
# Transposing
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A           1           3          -2           0           4          -5
B           0           3          -3          -3           4           0
C           1          -5          -3           0           1          -5
D           4          -4          -3           2          -2           3

### Selection

##### Getting

In [9]:
# A 컬럼 데이터를 출력
df['A']

2013-01-01    1
2013-01-02    3
2013-01-03   -2
2013-01-04    0
2013-01-05    4
2013-01-06   -5
Freq: D, Name: A, dtype: int64

In [10]:
df[0:3]

            A  B  C  D
2013-01-01  1  0  1  4
2013-01-02  3  3 -5 -4
2013-01-03 -2 -3 -3 -3

##### Selection by Label

In [11]:
df.loc[dates[0]]

A    1
B    0
C    1
D    4
Name: 2013-01-01 00:00:00, dtype: int64

In [12]:
# A와 B 컬럼 데이터를 처음 부터 끝까지 출력
df.loc[:,['A','B']]

            A  B
2013-01-01  1  0
2013-01-02  3  3
2013-01-03 -2 -3
2013-01-04  0 -3
2013-01-05  4  4
2013-01-06 -5  0

In [13]:
# 1월 2일 데이터에서 1월 4일 데이터까지 A, B 컬럼데이터를 출력
df.loc['20130102':'20130104',['A','B']]

            A  B
2013-01-02  3  3
2013-01-03 -2 -3
2013-01-04  0 -3

In [14]:
# 1월 2일 데이터를 A와 B 컬럼으로 출력
df.loc['20130102', ['A','B']]

A    3
B    3
Name: 2013-01-02 00:00:00, dtype: int64

- 데이터에 접근할때 loc로 접근하는것보다 at을 사용해서 접근하는것이 속도가 더 빠르다
- at은 하나의 value에대한 데이터만 가져올수 있다.

In [15]:
%%time
# For getting a scalar value
df.loc[dates[0],'A']

CPU times: user 80 µs, sys: 0 ns, total: 80 µs
Wall time: 84.2 µs

1

In [16]:
%%time
# For getting fast access to a scalar 
df.at[dates[0],'A']

CPU times: user 116 µs, sys: 0 ns, total: 116 µs
Wall time: 122 µs

1

##### Selection by Position
- http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer

In [17]:
df

            A  B  C  D
2013-01-01  1  0  1  4
2013-01-02  3  3 -5 -4
2013-01-03 -2 -3 -3 -3
2013-01-04  0 -3  0  2
2013-01-05  4  4  1 -2
2013-01-06 -5  0 -5  3

In [18]:
# iloc (integer index location) index 값으로 loc로 접근을 안해도 정수값으로 순서에 맞는 데이터를 가져옴
df.iloc[3]

A    0
B   -3
C    0
D    2
Name: 2013-01-04 00:00:00, dtype: int64

In [19]:
# 범위로 데이터 가져오기
df.iloc[3:5,0:2]

            A  B
2013-01-04  0 -3
2013-01-05  4  4

In [20]:
# 하나씩 지정해서 데이터 가져오기
df.iloc[[1,2,4],[0,2]]

            A  C
2013-01-02  3 -5
2013-01-03 -2 -3
2013-01-05  4  1

In [21]:
df.iloc[1:3,:]

            A  B  C  D
2013-01-02  3  3 -5 -4
2013-01-03 -2 -3 -3 -3

In [22]:
df.iloc[:,1:3]

            B  C
2013-01-01  0  1
2013-01-02  3 -5
2013-01-03 -3 -3
2013-01-04 -3  0
2013-01-05  4  1
2013-01-06  0 -5

- iloc로 value에 접근하는것보다 iat으로 접근하는게 더 빠르다.
- iat은 하나의 value에대한 데이터만 가져올수 있다.

In [23]:
%%time
df.iloc[1,1]

CPU times: user 113 µs, sys: 0 ns, total: 113 µs
Wall time: 118 µs

3

In [24]:
%%time
# For getting fast access to a scalar
df.iat[1,1]

CPU times: user 57 µs, sys: 0 ns, total: 57 µs
Wall time: 62.9 µs

3

##### Boolean Indexing

In [25]:
df

            A  B  C  D
2013-01-01  1  0  1  4
2013-01-02  3  3 -5 -4
2013-01-03 -2 -3 -3 -3
2013-01-04  0 -3  0  2
2013-01-05  4  4  1 -2
2013-01-06 -5  0 -5  3

In [9]:
df.A > 0

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [10]:
df[df.A > 0]

            A  B  C  D
2013-01-02  4 -4 -1  2

In [11]:
df > 0

                A      B      C      D
2013-01-01  False  False   True  False
2013-01-02   True  False  False   True
2013-01-03  False   True  False  False
2013-01-04  False   True   True  False
2013-01-05  False  False  False   True
2013-01-06  False   True  False  False

In [12]:
df[df > 0]

              A    B    C    D
2013-01-01  NaN  NaN  1.0  NaN
2013-01-02  4.0  NaN  NaN  2.0
2013-01-03  NaN  1.0  NaN  NaN
2013-01-04  NaN  1.0  4.0  NaN
2013-01-05  NaN  NaN  NaN  4.0
2013-01-06  NaN  3.0  NaN  NaN

##### isin method

In [30]:
# copy를 이용해서 데이터 프레임의 데이터를 새로운 메모리를 할당하여 복사할수 있다.
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

            A  B  C  D      E
2013-01-01  1  0  1  4    one
2013-01-02  3  3 -5 -4    one
2013-01-03 -2 -3 -3 -3    two
2013-01-04  0 -3  0  2  three
2013-01-05  4  4  1 -2   four
2013-01-06 -5  0 -5  3  three

In [31]:
# E 컬럼에 해당되는 데이터에 two와 four 값을 가진 데이터를 가져온다
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [13]:
df2[df2['E'].isin(['two','four'])]

Empty DataFrame
Columns: [A, B, C, D, E, F]
Index: []

### Setting

In [18]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [19]:
# df의 컬럼에 series을 넣을때, index 값이 없는 데이터는 NaN으로 데이터가 없다는 의미의 데이터가 들어간다.
df['F'] = s1
df

            A  B  C  D    F
2013-01-01  0  0  1 -1  NaN
2013-01-02  4 -4 -1  2  1.0
2013-01-03 -1  1 -2 -1  2.0
2013-01-04 -2  1  4 -3  3.0
2013-01-05 -5 -2 -5  4  4.0
2013-01-06 -4  3  0 -5  5.0

In [20]:
# Setting values by label
# at을 이용하여 특정 위치의 value 데이터를 바꿀수 있다.
df.at[dates[0],'A'] = 0
df

            A  B  C  D    F
2013-01-01  0  0  1 -1  NaN
2013-01-02  4 -4 -1  2  1.0
2013-01-03 -1  1 -2 -1  2.0
2013-01-04 -2  1  4 -3  3.0
2013-01-05 -5 -2 -5  4  4.0
2013-01-06 -4  3  0 -5  5.0

In [21]:
# Setting values by position
# iat을 이용하여 숫자값으로 위치를 설정하여 value 데이터를 바꿀수 있다.
df.iat[0,1] = 0
df

            A  B  C  D    F
2013-01-01  0  0  1 -1  NaN
2013-01-02  4 -4 -1  2  1.0
2013-01-03 -1  1 -2 -1  2.0
2013-01-04 -2  1  4 -3  3.0
2013-01-05 -5 -2 -5  4  4.0
2013-01-06 -4  3  0 -5  5.0

In [22]:
# Setting by assigning with a numpy array
# D 컬럼에 [5]데이터가 df의 데이터 수 만큼 리스트를 만들어서 컬럼데이터를 바꿀수 있다.
df.loc[:,'D'] = np.array([5] * len(df))
df

            A  B  C  D    F
2013-01-01  0  0  1  5  NaN
2013-01-02  4 -4 -1  5  1.0
2013-01-03 -1  1 -2  5  2.0
2013-01-04 -2  1  4  5  3.0
2013-01-05 -5 -2 -5  5  4.0
2013-01-06 -4  3  0  5  5.0

In [38]:
# 0보다 큰 value만 -를 붙임
df2 = df.copy()
df2[df2 > 0] = -df2
df2

            A  B  C  D    F
2013-01-01  0  0 -1 -5  NaN
2013-01-02 -3 -3 -5 -5 -1.0
2013-01-03 -2 -3 -3 -5 -2.0
2013-01-04  0 -3  0 -5 -3.0
2013-01-05 -4 -4 -1 -5 -4.0
2013-01-06 -5  0 -5 -5 -5.0

### Missing Data

In [39]:
df

            A  B  C  D    F
2013-01-01  0  0  1  5  NaN
2013-01-02  3  3 -5  5  1.0
2013-01-03 -2 -3 -3  5  2.0
2013-01-04  0 -3  0  5  3.0
2013-01-05  4  4  1  5  4.0
2013-01-06 -5  0 -5  5  5.0

In [40]:
# 인덱싱을 다시 한다.
# index 파라미터로 인덱싱을 하는 데이터의 범위를 나타내고
# columns 파라미터로 컬럼 데이터를 나타낸다.
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = [1,2]  # dates 0 ~ 1까지 value를 1,2로 변경한다.
df1

            A  B  C  D    F    E
2013-01-01  0  0  1  5  NaN  1.0
2013-01-02  3  3 -5  5  1.0  2.0
2013-01-03 -2 -3 -3  5  2.0  NaN
2013-01-04  0 -3  0  5  3.0  NaN

In [41]:
# To drop any rows that have missing data.
# NaN 데이터가 있는 row를 dropna를 이용하여 제거한다.
df1.dropna(how='any')

            A  B  C  D    F    E
2013-01-02  3  3 -5  5  1.0  2.0

In [42]:
df1.loc[dates[0]] = np.nan
df1

              A    B    C    D    F    E
2013-01-01  NaN  NaN  NaN  NaN  NaN  NaN
2013-01-02  3.0  3.0 -5.0  5.0  1.0  2.0
2013-01-03 -2.0 -3.0 -3.0  5.0  2.0  NaN
2013-01-04  0.0 -3.0  0.0  5.0  3.0  NaN

In [43]:
# how 옵션을 all로 주면 row의 모든데이터가 NaN인 row를 삭제한다.
df1.dropna(how='all')

              A    B    C    D    F    E
2013-01-02  3.0  3.0 -5.0  5.0  1.0  2.0
2013-01-03 -2.0 -3.0 -3.0  5.0  2.0  NaN
2013-01-04  0.0 -3.0  0.0  5.0  3.0  NaN

In [44]:
df1["F"] = np.nan
df1

              A    B    C    D   F    E
2013-01-01  NaN  NaN  NaN  NaN NaN  NaN
2013-01-02  3.0  3.0 -5.0  5.0 NaN  2.0
2013-01-03 -2.0 -3.0 -3.0  5.0 NaN  NaN
2013-01-04  0.0 -3.0  0.0  5.0 NaN  NaN

In [45]:
# axis 값으로 row를 삭제할지, column을 삭제할지 설정할수 있다.
df1.dropna(how='all', axis=1)

              A    B    C    D    E
2013-01-01  NaN  NaN  NaN  NaN  NaN
2013-01-02  3.0  3.0 -5.0  5.0  2.0
2013-01-03 -2.0 -3.0 -3.0  5.0  NaN
2013-01-04  0.0 -3.0  0.0  5.0  NaN

In [46]:
# Filling missing data
# NaN 데이터에 value 값을 5로 채워준다.
df1.fillna(value=5)

              A    B    C    D    F    E
2013-01-01  5.0  5.0  5.0  5.0  5.0  5.0
2013-01-02  3.0  3.0 -5.0  5.0  5.0  2.0
2013-01-03 -2.0 -3.0 -3.0  5.0  5.0  5.0
2013-01-04  0.0 -3.0  0.0  5.0  5.0  5.0

### Operations

### Stats

In [47]:
df

            A  B  C  D    F
2013-01-01  0  0  1  5  NaN
2013-01-02  3  3 -5  5  1.0
2013-01-03 -2 -3 -3  5  2.0
2013-01-04  0 -3  0  5  3.0
2013-01-05  4  4  1  5  4.0
2013-01-06 -5  0 -5  5  5.0

In [48]:
# 각 colum별 평균
# NaN 데이터는 평균값을 계산하는데 적용되지 않는다. (F = 1+2+3+4+5 / 5(not 6))
df.mean()

A    0.000000
B    0.166667
C   -1.833333
D    5.000000
F    3.000000
dtype: float64

In [49]:
# axis - 0:columns mean, 1:rows mean
print(df.mean(1))

2013-01-01    1.5
2013-01-02    1.4
2013-01-03   -0.2
2013-01-04    1.0
2013-01-05    3.6
2013-01-06    0.0
Freq: D, dtype: float64

In [50]:
# shift
# value 데이터를 쉬프트 하고 쉬프트되서 데이터가 없는 value는 NaN 데이터가 들어간다.
# -(minus) 값이 들어갈수 있다.
s = pd.Series([1,3,5,np.nan,6,8], index=dates)
print(s)
print(s.shift(2))
print(s.shift(-1))

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64
2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64
2013-01-01    3.0
2013-01-02    5.0
2013-01-03    NaN
2013-01-04    6.0
2013-01-05    8.0
2013-01-06    NaN
Freq: D, dtype: float64

In [51]:
df

            A  B  C  D    F
2013-01-01  0  0  1  5  NaN
2013-01-02  3  3 -5  5  1.0
2013-01-03 -2 -3 -3  5  2.0
2013-01-04  0 -3  0  5  3.0
2013-01-05  4  4  1  5  4.0
2013-01-06 -5  0 -5  5  5.0

In [52]:
# df에서 모든 컬럼에 s를 빼줌 (broadcating 개념으로 df에서 series를 빼준다.)
# NaN을 빼주면 NaN이 나옴
print(s)
df.sub(s, axis='index')

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

               A    B     C    D    F
2013-01-01  -1.0 -1.0   0.0  4.0  NaN
2013-01-02   0.0  0.0  -8.0  2.0 -2.0
2013-01-03  -7.0 -8.0  -8.0  0.0 -3.0
2013-01-04   NaN  NaN   NaN  NaN  NaN
2013-01-05  -2.0 -2.0  -5.0 -1.0 -2.0
2013-01-06 -13.0 -8.0 -13.0 -3.0 -3.0

##### Histogramming
- http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization

In [53]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    6
2    6
3    4
4    4
5    5
6    1
7    0
8    6
9    0
dtype: int64

In [54]:
# value 데이터를 같은 데이터끼리 묶어서 갯수를 센 데이터를 보여준다.
s.value_counts()

6    3
5    2
4    2
0    2
1    1
dtype: int64

##### String Methods
- http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods

In [55]:
# 다른 데이터 타입이 들어가면 NaN 데이터가 들어간다.
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat', 1])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
9     NaN
dtype: object

In [56]:
# 문자열 데이터를 대문자로 변경해준다.
_.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
9     NaN
dtype: object

In [57]:
# 문자열 데이터의 길이 데이터로 변경해준다.
_.str.len()

0    1.0
1    1.0
2    1.0
3    4.0
4    4.0
5    NaN
6    4.0
7    3.0
8    3.0
9    NaN
dtype: float64

### Merge

##### concat

In [58]:
df = pd.DataFrame(np.random.randint(1,10, size=(10,4)))
df

   0  1  2  3
0  4  1  2  1
1  2  3  4  7
2  2  9  2  9
3  8  7  5  5
4  1  4  8  1
5  3  1  8  4
6  1  1  6  8
7  6  3  5  8
8  7  7  9  7
9  9  1  3  5

In [59]:
# 리스트 데이터로 df 데이터를 나눈다.
pieces = [df[:3], df[3:7], df[7:]]
print(pieces[0], end="\n\n")
print(pieces[1], end="\n\n")
print(pieces[2])

   0  1  2  3
0  4  1  2  1
1  2  3  4  7
2  2  9  2  9

   0  1  2  3
3  8  7  5  5
4  1  4  8  1
5  3  1  8  4
6  1  1  6  8

   0  1  2  3
7  6  3  5  8
8  7  7  9  7
9  9  1  3  5

In [60]:
# df가 들어있는 리스트 데이터를 concat하면 데이터가 합쳐진다.
pd.concat(pieces)

   0  1  2  3
0  4  1  2  1
1  2  3  4  7
2  2  9  2  9
3  8  7  5  5
4  1  4  8  1
5  3  1  8  4
6  1  1  6  8
7  6  3  5  8
8  7  7  9  7
9  9  1  3  5

### Reshaping
- http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking

##### Stack

In [61]:
# zip
list(zip([1,2,3],[4,5,6],[7,8,9]))

[(1, 4, 7), (2, 5, 8), (3, 6, 9)]

In [62]:
tuples = list(zip(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                  ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [63]:
# MultiIndex : 인덱스데이터를 여러개 가질수 있다.(first와 second 두개의 인덱스를 가진다.)
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [64]:
df = pd.DataFrame(np.random.randint(10, size=(8, 2)), index=index, columns=['A', 'B'])
df

              A  B
first second
bar   one     7  1
      two     4  1
baz   one     0  4
      two     0  6
foo   one     1  6
      two     4  7
qux   one     5  8
      two     0  9

In [65]:
df2 = df[:4]
df2

              A  B
first second
bar   one     7  1
      two     4  1
baz   one     0  4
      two     0  6

In [66]:
# columns 데이터를 index에 추가시켜줌
stacked = df2.stack()
stacked

first  second
bar    one     A    7
               B    1
       two     A    4
               B    1
baz    one     A    0
               B    4
       two     A    0
               B    6
dtype: int64

In [67]:
stacked.index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two'], ['A', 'B']],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 0, 1, 1, 0, 0, 1, 1], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second', None])

In [68]:
# 가장 마지막에 있는 index 데이터를 column으로 바꿔줌
stacked.unstack()

              A  B
first second
bar   one     7  1
      two     4  1
baz   one     0  4
      two     0  6

In [69]:
# unstack은 여러번 사용이 가능
stacked.unstack().unstack()

         A       B
second one two one two
first
bar      7   4   1   1
baz      0   0   4   6

In [70]:
# 파라미터로 index를 지정해 줄수 있다.
# second가 colum으로 올라감
stacked.unstack(1)

second   one  two
first
bar   A    7    4
      B    1    1
baz   A    0    0
      B    4    6

In [71]:
# first가 colum으로 올라감
stacked.unstack(0)

first     bar  baz
second
one    A  7.0  0.0
       B  1.0  4.0
two    A  4.0  0.0
       B  1.0  6.0

In [72]:
# A, B가 colum으로 올라감
stacked.unstack(2)

              A  B
first second
bar   one     7  1
      two     4  1
baz   one     0  4
      two     0  6

### Time Series
- http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries

In [73]:
# 분단위로 100개의 시계열 데이터 생성
# freq - http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries-offset-aliases
rng = pd.date_range('2018-01-01', periods=100, freq='Min')
rng

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 00:01:00',
               '2018-01-01 00:02:00', '2018-01-01 00:03:00',
               '2018-01-01 00:04:00', '2018-01-01 00:05:00',
               '2018-01-01 00:06:00', '2018-01-01 00:07:00',
               '2018-01-01 00:08:00', '2018-01-01 00:09:00',
               '2018-01-01 00:10:00', '2018-01-01 00:11:00',
               '2018-01-01 00:12:00', '2018-01-01 00:13:00',
               '2018-01-01 00:14:00', '2018-01-01 00:15:00',
               '2018-01-01 00:16:00', '2018-01-01 00:17:00',
               '2018-01-01 00:18:00', '2018-01-01 00:19:00',
               '2018-01-01 00:20:00', '2018-01-01 00:21:00',
               '2018-01-01 00:22:00', '2018-01-01 00:23:00',
               '2018-01-01 00:24:00', '2018-01-01 00:25:00',
               '2018-01-01 00:26:00', '2018-01-01 00:27:00',
               '2018-01-01 00:28:00', '2018-01-01 00:29:00',
               '2018-01-01 00:30:00', '2018-01-01 00:31:00',
               '2018-01-01 00:32:00', '2018-01-01 00:33:00',
               '2018-01-01 00:34:00', '2018-01-01 00:35:00',
               '2018-01-01 00:36:00', '2018-01-01 00:37:00',
               '2018-01-01 00:38:00', '2018-01-01 00:39:00',
               '2018-01-01 00:40:00', '2018-01-01 00:41:00',
               '2018-01-01 00:42:00', '2018-01-01 00:43:00',
               '2018-01-01 00:44:00', '2018-01-01 00:45:00',
               '2018-01-01 00:46:00', '2018-01-01 00:47:00',
               '2018-01-01 00:48:00', '2018-01-01 00:49:00',
               '2018-01-01 00:50:00', '2018-01-01 00:51:00',
               '2018-01-01 00:52:00', '2018-01-01 00:53:00',
               '2018-01-01 00:54:00', '2018-01-01 00:55:00',
               '2018-01-01 00:56:00', '2018-01-01 00:57:00',
               '2018-01-01 00:58:00', '2018-01-01 00:59:00',
               '2018-01-01 01:00:00', '2018-01-01 01:01:00',
               '2018-01-01 01:02:00', '2018-01-01 01:03:00',
               '2018-01-01 01:04:00', '2018-01-01 01:05:00',
               '2018-01-01 01:06:00', '2018-01-01 01:07:00',
               '2018-01-01 01:08:00', '2018-01-01 01:09:00',
               '2018-01-01 01:10:00', '2018-01-01 01:11:00',
               '2018-01-01 01:12:00', '2018-01-01 01:13:00',
               '2018-01-01 01:14:00', '2018-01-01 01:15:00',
               '2018-01-01 01:16:00', '2018-01-01 01:17:00',
               '2018-01-01 01:18:00', '2018-01-01 01:19:00',
               '2018-01-01 01:20:00', '2018-01-01 01:21:00',
               '2018-01-01 01:22:00', '2018-01-01 01:23:00',
               '2018-01-01 01:24:00', '2018-01-01 01:25:00',
               '2018-01-01 01:26:00', '2018-01-01 01:27:00',
               '2018-01-01 01:28:00', '2018-01-01 01:29:00',
               '2018-01-01 01:30:00', '2018-01-01 01:31:00',
               '2018-01-01 01:32:00', '2018-01-01 01:33:00',
               '2018-01-01 01:34:00', '2018-01-01 01:35:00',
               '2018-01-01 01:36:00', '2018-01-01 01:37:00',
               '2018-01-01 01:38:00', '2018-01-01 01:39:00'],
              dtype='datetime64[ns]', freq='T')

In [74]:
# 위에 생성한 시계열 데이터를 인덱스로하는 0~500까지의 랜덤한 숫자를 100개 대입한 시리즈 데이터 생성
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.tail()

2018-01-01 01:35:00     31
2018-01-01 01:36:00     37
2018-01-01 01:37:00    446
2018-01-01 01:38:00     37
2018-01-01 01:39:00    264
Freq: T, dtype: int64

In [75]:
# 10분 간격으로 데이터를 sum을 이용해서 합쳐줌
ts.resample('10Min').sum()

2018-01-01 00:00:00    3141
2018-01-01 00:10:00    2280
2018-01-01 00:20:00    2126
2018-01-01 00:30:00    2047
2018-01-01 00:40:00    2319
2018-01-01 00:50:00    2518
2018-01-01 01:00:00    3166
2018-01-01 01:10:00    2555
2018-01-01 01:20:00    3196
2018-01-01 01:30:00    2071
Freq: 10T, dtype: int64

In [76]:
# Time Zone
rng = pd.date_range('2018-01-01 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05'],
              dtype='datetime64[ns]', freq='D')

In [77]:
ts = pd.Series(np.random.randint(0, 100, len(rng)), rng)
ts

2018-01-01    68
2018-01-02    39
2018-01-03    15
2018-01-04    35
2018-01-05    16
Freq: D, dtype: int64

In [78]:
# 타임존 데이터를 설정함 불러옴 (UTC(기준) : +00:00)
ts_utc = ts.tz_localize('UTC')
ts_utc

2018-01-01 00:00:00+00:00    68
2018-01-02 00:00:00+00:00    39
2018-01-03 00:00:00+00:00    15
2018-01-04 00:00:00+00:00    35
2018-01-05 00:00:00+00:00    16
Freq: D, dtype: int64

In [79]:
# 타임존을 변경 (US/Eastern : -05:00)
ts_utc.tz_convert('US/Eastern')

2017-12-31 19:00:00-05:00    68
2018-01-01 19:00:00-05:00    39
2018-01-02 19:00:00-05:00    15
2018-01-03 19:00:00-05:00    35
2018-01-04 19:00:00-05:00    16
Freq: D, dtype: int64

In [80]:
# Time zone list
# 타임존 리스트 확인
from pytz import common_timezones, all_timezones
len(common_timezones), len(all_timezones)

(439, 592)

In [81]:
# 월에 대한 date range의 날짜를 마지막날에서 1일로 바꾸기
# 날짜 데이터를 삭제한후에 다시 생성
rng = pd.date_range('1/1/2018', periods=5, freq='M')
rng

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31'],
              dtype='datetime64[ns]', freq='M')

In [82]:
ts = pd.Series(np.random.randint(0,10,len(rng)), index=rng)
ts

2018-01-31    4
2018-02-28    5
2018-03-31    2
2018-04-30    1
2018-05-31    7
Freq: M, dtype: int64

In [83]:
# to_period 날짜 데이터를 제거
ps = ts.to_period()
ps

2018-01    4
2018-02    5
2018-03    2
2018-04    1
2018-05    7
Freq: M, dtype: int64

In [84]:
# to_timestamp 날짜 데이터를 나타냄
ps.to_timestamp()

2018-01-01    4
2018-02-01    5
2018-03-01    2
2018-04-01    1
2018-05-01    7
Freq: MS, dtype: int64